Revit 2027 API
ExternalDataManagerDataItem.Version Property
 The version of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Version { get; set; }
Public Property Version As String
	Get
	Set
public:
property String^ Version {
	String^ get ();
	void set (String^ value);
}
member Version : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace